**free
Exec SQL
Select 
 (Count(*) - Sum(Case When l.status='A' Then 1 Else 0 End))*100
 / Count(*)
Into :Availability
From EMPMASTER e
Left Join LEAVES l
On e.empid = l.empid;
