     A          R APPROVE
     A            LEAVEID      7Y 0B  5 10
     A            STATUS       1A   O 7 10
     A            AIRISK      10A   O 9 10
